# JournalingAttribute Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
JournalingAttribute Constructor
JournalingAttribute Class See Also
---
Constructs a new JournalingAttribute.
**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public JournalingAttribute(
	JournalingMode mode
)
```

Visual Basic
---
```text
Public Sub New ( _
	mode As JournalingMode _
)
```

Visual C++
---
```text
public:
JournalingAttribute(
	JournalingMode mode
)
```

# ### Parameters
mode
    Type: Autodesk.Revit.Attributes..::..JournalingMode
# See Also
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace